ci4/app/Controllers/Artikel.php

SELECT *
FROM `kategori`
---
        // Tampilkan form
        $data = [
            'title'    => 'Tambah Artikel Baru',
            'kategori' => $kategoriModel->findAll()

SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '1'
SELECT *
FROM `kategori`
---
    public function edit($id)
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/user/login');
        }

        $artikelModel = new ArtikelModel();
        $kategoriModel = new KategoriModel();

        $data = [
            'title'    => 'Edit Artikel',
            'artikel'  => $artikelModel->find($id),
            'kategori' => $kategoriModel->findAll()

SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
---
    public function index()
    {
        $model = new ArtikelModel();

        $artikel = $model
            ->select('artikel.*, kategori.nama_kategori')
            ->join(
                'kategori',
                'kategori.id_kategori = artikel.id_kategori',
                'left'
            )
            ->findAll();

SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `slug` = 'artikel-pertama'
 LIMIT 1
---
    public function view($slug)
    {
        $model = new ArtikelModel();

        $artikel = $model
            ->select('artikel.*, kategori.nama_kategori')
            ->join(
                'kategori',
                'kategori.id_kategori = artikel.id_kategori',
                'left'
            )
            ->where('slug', $slug)
            ->first();