ci4/app/Controllers/User.php

SELECT *
FROM `user`
WHERE `useremail` = 'admin@email.com'
 LIMIT 1
---
    public function proses_login()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $model = new UserModel();
        $user = $model->where('useremail', $email)->first();